# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].
my_list = [8, 5, 5, 3, 2]
while True:
    new_rating = input("Введите натуральное число, оно будет новым элементом рейтинга: ")
    if new_rating.isdigit():
        new_rating = int(new_rating)
        break
    print("Необходимо было ввести натуральное число.")
my_list.append(new_rating)
my_list.sort(reverse=True)
print(my_list)
