# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
example_list = [5, 'text', 2.3, True, None]
print((type(example_list[0])), (type(example_list[1])), (type(example_list[2])), (type(example_list[3])),
      (type(example_list[4])))
